Repository: arcanecoast/trachecker
Catalog: languages/*/application.po
Languages: ru

source: Path
ru: Имя файла

source: Error type
ru: Тип ошибки

source: Anchor
ru: Местоположение

source: Open...
ru: Открыть...

source: Close
ru: Закрыть

source: Current file has been modified. Your changes will be lost! Do you want to continue?
ru: Текущий файл был изменен. Ваши изменения будут утрачены! Вы уверены, что хотите продолжить?

source: Warning
ru: Предупреждение

source: File wasn't neither saved nor checked
ru: Файл не был ни сохранен, ни проверен

source: Current file:
ru: Текущий файл:

source: Unable to check the file.
ru: Не удалось проверить файл.

source: Unable to create temporary file.
ru: Не удалось создать временный файл.

source: Error
ru: Ошибка

source: No errors, entries - %i! Last check on %s
ru: Ошибок нет, строк - %i! Последняя проверка %s

source: %s. Last check on %s
ru: %s. Последняя проверка %s

source: Error at %i:%i
ru: Ошибка возле %i:%i

source: No matches found!
ru: Совпадений не найдено!

source: Search finished
ru: Поиск завершен

source: Replace finished
ru: Замена завершена

source: Replaced count: %i
ru: Кол. замен: %i

source: Open translation file
ru: Открытие файл перевода

source: WeiDU TRA (*.tra)|*.tra|All files (*.*)|*.*
ru: WeiDU TRA (*.tra)|*.tra|Все файлы (*.*)|*.*

source: Do you really want to reload file from drive? All changes will be lost!
ru: Вы действительно хотите перезагрузить файл с диска? Все текущие изменения будут потеряны!

source: Search dialog
ru: Поиск

source: Replace dialog
ru: Замена

source: Select translation files
ru: Выберите файлы перевода

source: Batch checking
ru: Пакетная проверка

source: File: %s
ru: Файл: %s

source: No errors!
ru: Ошибок нет!

source: Unable to convert text to CP1251. File wasn't saved!
ru: Не удается преобразовать текст в CP1251. Файл не был сохранен!

source: Save translation file in %s codepage
ru: Сохранение файла перевода в кодировке %s

source: Please fix errors in translation file before exporting it to .TLK!
ru: Пожалуйста, исправьте ошибки в файле перевода прежде чем экспортировать его в .TLK!

source: Do you want to continue?
ru: Вы действительно хотите продолжить?

source: Export translation to BG:EE .TLK
ru: Экспорт перевода в BG:EE .TLK

source: Talktable file (*.tlk)|*.tlk|All files (*.*)|*.*
ru: Внутриигровой перевод (*.tlk)|*.tlk|Все файлы (*.*)|*.*

source: Import translation from BG:EE .TLK
ru: Импорт перевода из BG:EE .TLK

source: &New
ru: &Новый

source: &Open... Ctrl+O
ru: &Открыть... Ctrl+O

source: Re&load Ctrl+R
ru: Пере&загрузить Ctrl+R

source: &Save changes Ctrl+S
ru: &Сохранить Ctrl+S

source: S&ave as UTF-8 file...
ru: Сох&ранить как файл в UTF-8...

source: S&ave as CP1251 file...
ru: Сох&ранить как файл в CP1251...

source: E&xit ESC
ru: В&ыход ESC

source: &Undo Ctrl+Z
ru: &Отменить Ctrl+Z

source: &Redo Ctrl+Y
ru: &Повторить Ctrl+Y

source: &Cut Ctrl+X
ru: &Вырезать Ctrl+X

source: C&opy Ctrl+C
ru: &Копировать Ctrl+C

source: &Paste Ctrl+V
ru: В&ставить Ctrl+V

source: &Select all Ctrl+A
ru: В&ыделить все Ctrl+A

source: &Find... Ctrl+F
ru: &Найти... Ctrl+F

source: Find &next F3
ru: Поиск &вперед F3

source: Find &prev F2
ru: Поиск н&азад F2

source: &Replace Ctrl+H
ru: &Заменить Ctrl+H

source: &Check content Ctrl+T
ru: &Проверить текст Ctrl+T

source: Go to &mistake Ctrl+G
ru: Перейти к &ошибке Ctrl+G

source: Automatic recheck on save
ru: Перепроверять текст при сохранении

source: &Batch check Ctrl+B
ru: &Пакетная проверка Ctrl+B

source: Import text &from BG:EE style .TLK
ru: &Импорт текста из BG:EE .TLK

source: &Export text of BG:EE style .TLK
ru: &Экспорт текста в BG:EE .TLK

source: &About... F1
ru: &О программе... F1

source: &File
ru: &Файл

source: &Edit
ru: &Правка

source: &Search
ru: П&оиск

source: &Check
ru: П&роверка

source: &Utils
ru: &Инструменты

source: &Help
ru: &Справка

source: - Translation file is empty.
ru: - Файл перевода пуст.

source: - Translation file's first entry must have @0 or @1 index but first index is @%i.
ru: - Первая запись в файле перевода должна начинаться с индекса @0 или @1, а начинается с @%i.

source: - Translation file has non contiguous entries (@%i, @%i).
ru: - Файл перевода содержит записи с непоследовательно идущими индексами (@%i, @%i).

source: Logic error: content without @id
ru: Логическая ошибка: контент без @идентификатора

source: Logic error: bad @id format
ru: Логическая ошибка: некорректный формат @идентификатора

source: Logic error: no text section before sound specification
ru: Логическая ошибка: отсутствует текстовая секция перед определением звук. файла

source: Logic error: third text section detected
ru: Логическая ошибка: обнаружена третья текстовая секция

source: Logic error: third sound specification detected
ru: Логическая ошибка: обнаружено третье определение звук. файла

source: Logic error: broken link
ru: Логическая ошибка: поврежденная ссылка

source: Logic error: cycle of references found
ru: Логическая ошибка: обнаружено зацикливание ссылок

source: Logic error: entry with such id is already defined
ru: Логическая ошибка: такой же идентификатор записи встречается второй раз

source: Unknown logic error
ru: Неизвестная логическая ошибка

source: Syntax error: bad index
ru: Синтаксическая ошибка: некорректный индекс

source: Syntax error: unexpected symbol
ru: Синтаксическая ошибка: неожиданный символ

source: Syntax error: equaleness symbol is missing
ru: Синтаксическая ошибка: пропущен символ "="

source: Syntax error: unexpected end of file
ru: Синтаксическая ошибка: неожиданый конец файла

source: Unknown syntax error
ru: Неизвестная синтаксическая ошибка
